[
    {
      "text": "Looking for internships? Here are 5 tips to land your dream internship at top MNCs:\n1. Tailor your resume.\n2. Network with employees.\n3. Showcase relevant projects.\n4. Prepare for common interview questions.\n5. Follow up after the interview.\n\nRemember, persistence is key!\n#internships #career",
      "engagement": 195
    },
    {
      "text": "Beware of scams! Many students are falling prey to fake internship offers asking for upfront payments. Always verify the company and check their official website or LinkedIn page before proceeding.\nStay alert and share this with others to spread awareness.\n#scamalert #internships",
      "engagement": 340
    },
    {
      "text": "Ever wondered what makes multinational companies so appealing?\n1. Global exposure.\n2. Structured career growth.\n3. Learning from industry leaders.\n\nBut remember, they look for skilled, passionate, and team-oriented individuals. Are you prepared?\n#MNCs #CareerGrowth",
      "engagement": 205
    },
    {
      "text": "Internship hunting can be tough, but here’s a golden rule: apply to at least 10 positions daily and tailor each application. It might take time, but the results will come!\nRemember, every rejection is a step closer to success.\n#internships #careeradvice",
      "engagement": 270
    },
    {
      "text": "How to spot a fake job posting:\n1. Vague descriptions.\n2. Unverified email addresses.\n3. Upfront fees or personal info requests.\n\nYour safety is priority. Trust your instincts and double-check every detail. Share this to help others!\n#scamalert #jobsearch",
      "engagement": 465
    },
    {
      "text": "Thinking about working in a multinational company? Here’s a reality check:\n- Great benefits and exposure.\n- Highly competitive environment.\n- Opportunities to grow globally.\n\nKnow what you’re signing up for and aim high!\n#MNCs #CareerTips",
      "engagement": 180
    },
    {
      "text": "Here’s a quick tip for internships: Always send a thank-you email after interviews. It’s a small gesture that makes a big impact.\n#internships #careerbuilding",
      "engagement": 145
    },
    {
      "text": "Scam Alert: Some fake recruiters are asking for your social media credentials in exchange for internships. NEVER share personal account details. Stay safe!\n#internships #jobsearch",
      "engagement": 320
    },
    {
      "text": "Networking 101: If you want an internship at an MNC, connect with employees on LinkedIn, engage with their posts, and show genuine interest in their work.\n#networking #internships",
      "engagement": 250
    },
    {
      "text": "Multinational companies are hiring fresh talent for leadership programs. If you have what it takes to lead, don’t miss these opportunities!\n#leadership #MNCjobs",
      "engagement": 290
    }
  ]
  